# taps
tap "homebrew/bundle"
tap "railwaycat/emacsmacport"
tap "aws/tap"
tap "sdkman/tap"

# brews
brew "ansible"
brew "awscli"
brew "bash-language-server"
brew "bat"
brew "coreutils"
brew "crane"
brew "duti"
brew "helm"
brew "eks-node-viewer"
brew "emacs-mac", args: ["with-starter", "with-native-comp", "with-emacs-big-sur-icon"]
brew "exercism"
brew "gh"
brew "git"
brew "git-lfs"
brew "golang"
brew "gopls"
brew "gnupg"
brew "grep"
brew "fd"
brew "fnm" # NodeJS versions manager
brew "fontconfig"
brew "fzf"
brew "kind"
brew "kubebuilder"
brew "kubectl"
brew "lazygit"
brew "lua-language-server"
brew "marked" # Markdown formatter
brew "mas" # MacOS installer from App Store
brew "neovim"
brew "pinentry-mac"
brew "prettier"
brew "ripgrep"
brew "sdkman-cli"
brew "shellcheck"
brew "sqlite3"
brew "sops"
brew "starship" # terminal prompt
brew "staticcheck"
brew "stow"
brew "stylua" # lua formatter
brew "taplo" # TOML LSP server
brew "terraform"
brew "terraform-ls"
brew "tree"
brew "yaml-language-server"
brew "zoxide"

# casks
cask "1password"
cask "docker"
cask "font-fira-sans"
cask "font-hack-nerd-font"
cask "iterm2", greedy: true
cask "maccy" # Better clipboard
cask "openvpn-connect"
cask "rectangle"
cask "spotify"
cask "zoom"

# Applications from App Store
mas "HP Smart for Desktop", id: 1474276998
mas "Quip", id: 1003160018
