# Taps

# CLI tools
brew "awscli"
brew "bat"
brew "direnv"
brew "fzf"
brew "gh"
brew "git"
brew "gnupg"
brew "grep"
brew "helm"
brew "jq"
brew "kubectl"
brew "kubectx"
brew "lazygit"
brew "neovim"
brew "node@22"
brew "mage"
brew "pinentry-mac"
brew "ripgrep"
brew "starship"
brew "stow"
brew "terraform"
brew "zoxide"

# Casks (GUI apps)
cask "1password"
cask "claude"
cask "cursor"
cask "docker-desktop"
cask "iterm2"
cask "maccy"

# Fonts
cask "font-fira-code"
cask "font-jetbrains-mono"

# Mac App Store (optional, requires mas-cli)
brew "mas"
